[
  {
    "Function": "inspectIndividualProperty()",
    "Error": "page.waitForTimeout is not a function"
  },
  {
    "Function": "inspectIndividualProperty()",
    "Error": "page.waitForTimeout is not a function"
  },
  {
    "Function": "inspectIndividualProperty()",
    "Error": "page.waitForTimeout is not a function"
  },
  {
    "Function": "inspectIndividualProperty()",
    "Error": "page.waitForTimeout is not a function"
  },
  {
    "Function": "inspectIndividualProperty()",
    "Error": "page.waitForTimeout is not a function"
  },
  {
    "URL": "https://www.rightmove.co.uk/properties/149743436#/?channel=RES_BUY",
    "address": "Station Road, Roslin, EH25 9LR",
    "propertyType": "Flat",
    "bedrooms": "2",
    "bathrooms": "1",
    "size": "Ask agent",
    "price": "No Price Found",
    "phoneNumber": "No Phone Number Available",
    "keyFeatures": "Reference - KA0673Recently RenovatedTwo BedroomsNew KitchenNew BathroomNew Central Heating SystemPrivate GardenRare OpportunityWalk In ConditionPerfect For First Time Buyers",
    "description": "Description\n\nReference - KA0673\n\nStation Road presents an incredibly rare opportunity to purchase a recently renovated and immaculately presented two bedroom flat located in Roslin. The tranquil vilage of Roslin which is located just 7 miles to the South from the City of Edinburgh is famous well known all over the world for Rosslyn Chapel which was mentioned in ' The Da Vinci Code' books. Within walking distance of the property there is several amenities such as cafes, restaurants and shops. Frequent transport links are available to take you into the city centre. \n\nThe property has undergone a full transformation before sale and is presented in true walk-in condition. Upon entering the property you are greeted into the welcoming entrance hallway. From the hall you'll find the heart of the home, a spacious lounge with large windows allowing for plenty of natural light. From the lounge, the next room is the kitchen which has been recently fitted prior to the sale. The kitchen has a combination of wall and base mounted units along with an integrated oven and hobs. \n\nThe first of the bedrooms is a sizeable double bedroom with new carpets laid prior to the sale. There is also a built in storage cupboard in the first bedroom. The second bedroom is also a good size with a large storage cupboard in place. Completing the internal accommodation is an brand new bathroom consisting of a walk in shower, W.C. and hand basin. \n\nOutside, the property has sole use of it's own patch of garden which is a major advantage for a flat. On street parking is available. \n\nThe property benefits from a brand new central heating system along with double glazing throughout. \n\nEarly viewing highly recommended. \n\n \n\nRead full description",
    "saleHistory": "Sale History Not Available",
    "Nearby Properties Sold": null
  },
  {
    "URL": "https://www.rightmove.co.uk/properties/146347433#/?channel=RES_BUY",
    "address": "48 (GF1) Jordan Lane, Morningside, Edinburgh, EH10",
    "propertyType": "Flat",
    "bedrooms": "1",
    "bathrooms": "1",
    "size": "272 sq ft\n\n25 sq m",
    "price": "No Price Found",
    "phoneNumber": "No Phone Number Available",
    "keyFeatures": "Prime Morningside area of EdinburghTraditional tenementGround floor flatOpen plan accommodationOne double bedroomElectric heatingCommunal rear gardenOn street permit parking (zone S2)",
    "description": "Description\nGreat opportunity for a first-time buyer, investor (Potential rent £1,000PCM) or someone looking for a pied-à-terre in the highly desirable Morningside district of Edinburgh, south of the city centre.\n\nThis is a one bedroom ground floor flat located in a quiet street just off Morningside Road. Accessed via a communal stairwell, the accommodation comprises: hallway with storage cupboard; open plan sitting room/kitchen with large window allowing in plenty of natural light and a fireplace, the kitchen has ample wall and base unit and freestanding appliances; double bedroom with space for freestanding furniture and; a shower room with shower, wash hand basin and WC which completes the accommodation.\n\nThe property has the benefit of electric heating, access to a communal rear garden and on street permit parking under Zone S2) which add to the appeal of the property.\n\nMorningside is one of Edinburgh's most desirable districts and lies approximately 2 miles south of the city centre. In conjunction with its neighbouring district of Bruntsfield, it provides an infinite selection of local and speciality shopping, including a Waitrose, an M&S and Sainsbury’s Local. The famous privately owned Dominion Cinema and an excellent choice of restaurants and bars make the area amenity rich. For exercise and recreation, The Hermitage of Braid, Blackford Hill and Braidburn Park and the Pentland Hills Country Park are all situated nearby as is the dry ski slope at Hillend. Locally there are many golf courses including The Merchants, Mortonhall and the Braid Hills Golf Centre. The city centre is easily accessible by car or by excellent public transport services from Morningside Road. Edinburgh city bypass is easily accessed and provides direct links to Straiton Retail Park, The Gyle, Edinburgh International Airport and the M8 and M9 Motorways.\n\nAll window furnishings (curtains, curtain poles, blinds etc), floor coverings, light fixtures and appliances (both integrated and free standing) are included in the sale.\n\nUnder the HMRC Anti Money Laundering legislation, all offers to purchase a property on a cash basis or subject to mortgage require evidence of source of funds and required to produce proof of identity and proof of address. This is acceptable either as original or certified documents.\n\nEPC: F\nCouncil Tax: B - £1550.95 inclusive of water and sewage* (*based on 2024/2025 tax year) - The City of Edinburgh Council\nTenure: Freehold\nElectricity Supply: Mains supply.\nWater Supply: Scottish Water\nSewerage: Scottish Water\nHeating: Electric & gas – electric storage radiator in the bedroom and gas fire in the sitting room/kitchen.\nBroadband: 1000 MBPS (Potential download speed)\nMobile Signal/Coverage: Full 4G and potential 5G outdoor coverage\nParking: On street permit and pay-and-display parking is available on Jordan Lane and surrounding streets under zone S2 (Permits obtained upon application to The City of Edinburgh Council and payment of fees)\nAll statements contained herein are believed to be correct but are not guaranteed and interested parties must satisfy themselves as to their accuracy.\n\n\n\nBrochures\n\nParticulars\nRead full description",
    "saleHistory": "Sale History Not Available",
    "Nearby Properties Sold": null
  }
]